#include <stdio.h>

void func() {
    int local_array[1000];
    static int static_array[1000] = {1};
    printf("%p %p\n", local_array, static_array);
}

int main() {
    func();
    return 0;
}


// text - код, data - змінні, BSS - Не визначені змінні, Dec - розмір минулих сегментів

// task 2.2.4 - Не статичні змінні не залишаються у виконуваному файлі.
// Якщо масив ініціалізовано, то він записується в data, якщо ні, то в BSS і не впливає на Dec - розмір файлу

// task 2.2.5:
// -g Включаємо відлагоджувальну інф., розмір збільшився
// -O0 Вимикаємо оптимізацію, код має початкову структуру, розмір такий самий, як і початковий
// -O2 Включаємо оптимізацію, видаляє змінні, що не використовуються, файл більше ніж початковий