// Приклад з IP (інструкційного покажчика) + використання стеку

// #include <stdio.h>
// #include <setjmp.h>

// jmp_buf buffer;

// void func() {
//     printf("У функції\n");
//     longjmp(buffer, 1); // Зберігаємо поточний стан та лічильник команд. Повертаємось до setjmp
// }

// int main() {
//     if (setjmp(buffer) == 0) { // Оскільки ми повернулись сюди після повернення й зминили значення, то відповідно 
//         func();
//     } else { // Відбудеться перехід до else
//         printf("В мейні");
//     }
//     return 0;
// }

// В даному випадку, оскільки ми зберігаємо поточний стан, то можна обійтись без автоматичного переходу або повернення IP (інструкційного покажчика).
// Повністю відмовившись від допомоги IP (інструкційного покажчика) неможливо зробити коректне повернення з виклику, оскільки процесор не знатиме, куди передати керування. 


// Приклад зі стеком, повністю відмовившись від IP (інструкційного покажчика):

#include <stdio.h>

void func() {
    printf("Повертаємось до адреси останнього елементу стеку\n");
    asm("ret");  // Видається помилка, оскільки останній елемент стеку необов'язково є коректним й передає вірну адресу
}

int main() {
    printf("В мейні\n");
    func();
    printf("Повернення до мейну\n");  // Не виконається
    return 0;
}

// В цьому прикладі не використовується IP (інструкційного покажчика), замість нього ми використовуємо останній елемент стеку, щоб отримати адресу для повернення
// Таким чином, використання стеку при цьому відмовившись від IP (інструкційного покажчика) є неможливим